pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
static TL_CmdPacket_t *p_thread_otcmdbuffer;
static TL_EvtPacket_t *p_thread_notif_M0_to_M4;
static __IO uint32_t  CptReceiveMsgFromM0 = 0;
static volatile int FlagReceiveAckFromM0 = 0;


PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_TH_Config_t ThreadConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ThreadNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadCliCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadCliNotBuffer;

osThreadId_t OsTaskMsgM0ToM4Id;      /* Task managing the M0 to M4 messaging        */
#if (CFG_FULL_LOW_POWER == 0)
static osThreadId_t OsTaskCliId;            /* Task used to manage CLI comamnd             */
#endif /* (CFG_FULL_LOW_POWER == 0) */

/* USER CODE BEGIN PV */
static otCoapResource OT_Ressource = {C_RESSOURCE, APP_THREAD_CoapRequestHandler,"buzz", NULL};
static otMessageInfo OT_MessageInfo = {0};
static uint8_t OT_Command = 0;
static uint8_t OT_ReceivedCommand = 0;
static otMessage   * pOT_Message = NULL;
static otLinkModeConfig OT_LinkMode = {0};
static uint32_t sleepyEndDeviceFlag = FALSE;
static uint8_t sedCoapTimerID;
static uint8_t setThreadModeTimerID;
static void APP_THREAD_CoapSendDataResponse(otMessage    * pMessage,
    const otMessageInfo * pMessageInfo);

/* Debug */
static uint32_t DebugRxCoapCpt = 0;
static uint32_t DebugTxCoapCpt = 0;

static uint8_t PayloadWrite[30]= {0};
static uint8_t PayloadRead[30]= {0};

static volatile uint8_t waitingForAck = 0;

extern volatile uint8_t g_ot_notification_allowed;

/* USER CODE END PV */

/* Functions Definition ------------------------------------------------------*/

//void APP_THREAD_Init( void )
//{
//  /* USER CODE BEGIN APP_THREAD_INIT_1 */
//
//  /* USER CODE END APP_THREAD_INIT_1 */
//
//  SHCI_CmdStatus_t ThreadInitStatus;
//
//  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
//  APP_THREAD_CheckWirelessFirmwareInfo();
//
//#if (CFG_USB_INTERFACE_ENABLE != 0)
//  VCP_Init(&VcpTxBuffer[0], &VcpRxBuffer[0]);
//#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */
//
//  /* Register cmdbuffer */
//  APP_THREAD_RegisterCmdBuffer(&ThreadOtCmdBuffer);
//
//  /**
//   * Do not allow standby in the application
//   */
//  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_THREAD, UTIL_LPM_DISABLE);
//
//  /* Init config buffer and call TL_THREAD_Init */
//  APP_THREAD_TL_THREAD_INIT();
//
//  /* Configure UART for sending CLI command from M4 */
////  APP_THREAD_Init_UART_CLI();
//
//  /* Send Thread start system cmd to M0 */
//  ThreadInitStatus = SHCI_C2_THREAD_Init();
//
//  /* Prevent unused argument(s) compilation warning */
//  UNUSED(ThreadInitStatus);
//
//  /* USER CODE BEGIN APP_THREAD_INIT_TIMER */
//
//  /* USER CODE END APP_THREAD_INIT_TIMER */
//
//  /* Create the different FreeRTOS tasks requested to run this Thread application*/
//  OsTaskMsgM0ToM4Id = osThreadNew(APP_THREAD_FreeRTOSProcessMsgM0ToM4Task, NULL,&ThreadMsgM0ToM4Process_attr);
//
//  /* USER CODE BEGIN APP_THREAD_INIT_FREERTOS */
//
//  /* USER CODE END APP_THREAD_INIT_FREERTOS */
//
//  /* Configure the Thread device at start */
//  APP_THREAD_DeviceConfig();
//
//  /* USER CODE BEGIN APP_THREAD_INIT_2 */
//
//  /* USER CODE END APP_THREAD_INIT_2 */
//}

/**
  * @brief  Trace the error or the warning reported.
  * @param  ErrId :
  * @param  ErrCode
  * @retval None
  */
void APP_THREAD_Error(uint32_t ErrId, uint32_t ErrCode)
{
  /* USER CODE BEGIN APP_THREAD_Error_1 */

  /* USER CODE END APP_THREAD_Error_1 */
  switch(ErrId)
  {
  case ERR_REC_MULTI_MSG_FROM_M0 :
    APP_THREAD_TraceError("ERROR : ERR_REC_MULTI_MSG_FROM_M0 ", ErrCode);
    break;
  case ERR_THREAD_SET_STATE_CB :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_STATE_CB ",ErrCode);
    break;
  case ERR_THREAD_SET_CHANNEL :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_CHANNEL ",ErrCode);
    break;
  case ERR_THREAD_SET_PANID :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_PANID ",ErrCode);
    break;
  case ERR_THREAD_IPV6_ENABLE :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_IPV6_ENABLE ",ErrCode);
    break;
  case ERR_THREAD_START :
    APP_THREAD_TraceError("ERROR: ERR_THREAD_START ", ErrCode);
    break;
  case ERR_THREAD_ERASE_PERSISTENT_INFO :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_ERASE_PERSISTENT_INFO ",ErrCode);
    break;
  case ERR_THREAD_CHECK_WIRELESS :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ",ErrCode);
    break;
  /* USER CODE BEGIN APP_THREAD_Error_2 */

  /* USER CODE END APP_THREAD_Error_2 */
  default :
    APP_THREAD_TraceError("ERROR Unknown ", 0);
    break;
  }

}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief Thread initialization.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
  otError error;
  otNetworkKey networkKey = {{0x00, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99, 0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0xFF}};

//  error = otInstanceErasePersistentInfo(NULL);
//  if (error != OT_ERROR_NONE)
//  {
//    APP_THREAD_Error(ERR_THREAD_ERASE_PERSISTENT_INFO,error);
//  }
  otInstanceFinalize(NULL);
  otInstanceInitSingle();
  error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_STATE_CB,error);
  }
  error = otLinkSetChannel(NULL, C_CHANNEL_NB);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_CHANNEL,error);
  }
  error = otLinkSetPanId(NULL, C_PANID);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_PANID,error);
  }
  error = otThreadSetNetworkKey(NULL, &networkKey);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_NETWORK_KEY,error);
  }
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE,error);
  }
  error = otThreadSetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_START,error);
  }

