pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
  /* Init config buffer and call TL_THREAD_Init */
  APP_THREAD_TL_THREAD_INIT();

  /* Configure UART for sending CLI command from M4 */
//  APP_THREAD_Init_UART_CLI();

  /* Send Thread start system cmd to M0 */
  ThreadInitStatus = SHCI_C2_THREAD_Init();

  /* Prevent unused argument(s) compilation warning */
  UNUSED(ThreadInitStatus);

  MoNotifQueue = xQueueCreate(10, sizeof(uint8_t));
  	if (MoNotifQueue == NULL) {
  		Error_Handler();  	}


  // TODO: added this call and remove the lines after since (I think) they are unnecessary
  OsTaskMsgM0ToM4Id = osThreadNew(APP_THREAD_FreeRTOSProcessMsgM0ToM4Task, NULL,&ThreadMsgM0ToM4Process_attr);



//  /* Register task */
//  /* Create the different tasks */
//  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_MSG_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_THREAD_ProcessMsgM0ToM4);
//  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_COAP_MSG_BUTTON, UTIL_SEQ_RFU, APP_THREAD_SendCoapMsg);
//
//  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_COAP_SEND_MSG, UTIL_SEQ_RFU,APP_THREAD_SendCoapMsg);
//  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_SET_THREAD_MODE, UTIL_SEQ_RFU,APP_THREAD_SetSleepyEndDeviceMode);
}

void APP_THREAD_Init_Dyn_2(void) {
  /* Initialize and configure the Thread device*/
  APP_THREAD_DeviceConfig();

  //TODO: removed below as per Thread-only FreeRTOS example
  /**
   * Create timer to handle COAP request sending
   */
//  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &sedCoapTimerID, hw_ts_Repeated, APP_THREAD_CoapTimingElapsed);
//  SHCI_C2_RADIO_AllowLowPower(THREAD_IP,TRUE);
//  UTIL_LPM_SetStopMode(1 << CFG_LPM_APP_THREAD, UTIL_LPM_ENABLE);
  /* Allow the 800_15_4 IP to enter in low power mode */
}

void APP_THREAD_Stop(void)
{
  otError error;
  /* STOP THREAD */
  error = otThreadSetEnabled(NULL, false);
  if (error != OT_ERROR_NONE)
  {
     APP_THREAD_Error(ERR_THREAD_STOP,error);
  }
}

void APP_THREAD_CleanCallbacks(void)
{
  otRemoveStateChangeCallback(NULL, APP_THREAD_StateNotif, NULL);
  otCoapRemoveResource(NULL, &OT_Ressource);

//  /* Remove Timers if any */
//  HW_TS_Delete(setThreadModeTimerID);
//  HW_TS_Delete(sedCoapTimerID);
}

/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void APP_THREAD_RegisterCmdBuffer(TL_CmdPacket_t* p_buffer)
{
  p_thread_otcmdbuffer = p_buffer;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)p_thread_otcmdbuffer->cmdserial.cmd.payload;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdRspPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)((TL_EvtPacket_t *)p_thread_otcmdbuffer)->evtserial.evt.payload;
}

Thread_OT_Cmd_Request_t* THREAD_Get_NotificationPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)(p_thread_notif_M0_to_M4)->evtserial.evt.payload;
}

/**
 * @brief  This function is used to transfer the Ot commands from the
 *         M4 to the M0.
 *
 * @param   None
 * @return  None
 */
void Ot_Cmd_Transfer(void)
{
//	ot_StatusNot(ot_TL_CmdBusy);
	   if(osOK != osMutexAcquire(MtxHciId, osWaitForever)){
	    	Error_Handler();
	    }

  /* OpenThread OT command cmdcode range 0x280 .. 0x3DF = 352 */
  p_thread_otcmdbuffer->cmdserial.cmd.cmdcode = 0x280U;
  /* Size = otCmdBuffer->Size (Number of OT cmd arguments : 1 arg = 32bits so multiply by 4 to get size in bytes)
   * + ID (4 bytes) + Size (4 bytes) */
  uint32_t l_size = ((Thread_OT_Cmd_Request_t*)(p_thread_otcmdbuffer->cmdserial.cmd.payload))->Size * 4U + 8U;
  p_thread_otcmdbuffer->cmdserial.cmd.plen = l_size;

  TL_OT_SendCmd();

  /* Wait completion of cmd */
  Wait_Getting_Ack_From_M0();

  if(osOK != osMutexRelease(MtxHciId)){
   	Error_Handler();
   }

//  ot_StatusNot(ot_TL_CmdAvailable);

}

void ot_StatusNot( ot_TL_CmdStatus_t status )
{
if(MtxOtCmdId == 0){
	return;
}

  switch (status)
  {
    case ot_TL_CmdBusy:
        if(osOK != osSemaphoreAcquire( MtxOtCmdId, osWaitForever )){
        	Error_Handler();
        }
      break;

    case ot_TL_CmdAvailable:
        if(osOK != osSemaphoreRelease( MtxOtCmdId )){
        	Error_Handler();
        }
      break;

    default:
      break;
  }
  return;
}

static void ot_Ack( ot_TL_CmdStatus_t status )
{
  switch (status)
  {
    case ot_TL_CmdBusy:
    	osSemaphoreAcquire( MtxOtAckId, osWaitForever );
      break;

    case ot_TL_CmdAvailable:
    	osSemaphoreRelease( MtxOtAckId );
      break;

    default:
      break;
  }
  return;
}

/**
 * @brief  This function is used to transfer the Ot commands from the
 *         M4 to the M0 with Notification M0 to M4 allowed.
 *
 * @param   None
 * @return  None
 */
void Ot_Cmd_TransferWithNotif(void)
{
  /* Flag to specify to UTIL_SEQ_EvtIdle that M0 to M4 notifications are allowed */
  g_ot_notification_allowed = 1U;



  Ot_Cmd_Transfer();
}


/**
 * @brief  This function is called when acknowledge from OT command is received from the M0+.
 *
 * @param   Otbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_OT_CmdEvtReceived( TL_EvtPacket_t * Otbuffer )
{
	//WARNING: CALLED FROM ISR

  /* Prevent unused argument(s) compilation warning */
  UNUSED(Otbuffer);

  Receive_Ack_From_M0();

  /* Does not allow OpenThread M0 to M4 notification */
  g_ot_notification_allowed = 0U;
}

/**
 * @brief  This function is called when notification from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_THREAD_NotReceived( TL_EvtPacket_t * Notbuffer )
{
  p_thread_notif_M0_to_M4 = Notbuffer;

  Receive_Notification_From_M0();
}

/**
  * @brief  This function is called before sending any ot command to the M0
  *         core. The purpose of this function is to be able to check if
  *         there are no notifications coming from the M0 core which are
  *         pending before sending a new ot command.
  * @param  None
  * @retval None
  */
void Pre_OtCmdProcessing(void)
{
	/* We want to only run this if no other thread
	 * is running an M0 command
	 *
	 * Possible threads:
	 *  ShciUserEvtProcessId
	 *  HciUserEvtProcessId
	 *  AdvUpdateProcessId
	 *  OsTaskMsgM0ToM4Id (APP_THREAD_FreeRTOSProcessMsgM0ToM4Task)
	 *
	 *  If no M0 commands are run, we can trigger
	 *  OsTaskMsgM0ToM4Id
	 */

