pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
  /* Copy the characteres in the temporary buffer */
  for (i = 0; i < *Len; i++)
  {
    TmpString[len_total++] = Buf[i];
  }

  /* Process the buffer commands one by one     */
  /* A command is limited by a \r caracaters    */
  while (flag_continue_checking == TRUE)
  {
    char_remaining = ProcessCmdString(TmpString,len_total);
    /* If char_remaining is equal to len_total, it means that the command string is not yet
     * completed.
     * If char_remaining is equal to 0, it means that the command string has
     * been entirely processed.
     */
    if ((char_remaining == 0) || (char_remaining == len_total))
    {
      flag_continue_checking = FALSE;
    }
    len_total = char_remaining;
  }
}
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
/**
  * @brief Handler called when the server receives a COAP request.
  * @param pContext : Context
  * @param pMessage : Message
  * @param pMessageInfo : Message information
  * @retval None
  */
static void APP_THREAD_CoapRequestHandler(void                * pContext,
                                          otMessage           * pMessage,
                                          const otMessageInfo * pMessageInfo)
{
  do
  {
//    if (otCoapMessageGetType(pMessage) != OT_COAP_TYPE_NON_CONFIRMABLE)
//    {
//      break;
//    }

//    if (otCoapMessageGetCode(pMessage) != OT_COAP_CODE_PUT)
//    {
//      break;
//    }
	  uint16_t receivedBytes;
	  receivedBytes = otMessageRead(pMessage, otMessageGetOffset(pMessage), PayloadRead, sizeof(PayloadRead));
	  if (strncmp(PayloadRead, "test", 4) == 0) {
		  toggledBlue();
			osThreadFlagsSet(AdvUpdateProcessId, 1);

	  } else {
//		  printf("The string does not start with 'test'.\n");
	  }

//    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U)
//    {
//      APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
//    }

    if (OT_ReceivedCommand == 1U)
    {
//      BSP_LED_Toggle(LED3);
//      APP_DBG("**** Recept COAP nb **** %d ",DebugRxCoapCpt++);
    }

    /* If Message is Confirmable, send response */
    if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE)
    {
      APP_THREAD_CoapSendDataResponse(pMessage, pMessageInfo);
    }

  } while (false);
}

/**
 * @brief This function acknowledges the data reception by sending an ACK
 *    back to the sender.
 * @param  pMessage coap message
 * @param  pMessageInfo message info pointer
 * @retval None
 */
static otMessage* pOT_MessageResponse = NULL;
static void APP_THREAD_CoapSendDataResponse(otMessage  * pMessage,
    const otMessageInfo * pMessageInfo)
{
  otError  error = OT_ERROR_NONE;

  do{
    APP_DBG("APP_THREAD_CoapSendDataResponse");

    pOT_MessageResponse = otCoapNewMessage(NULL, NULL);
    if (pOT_MessageResponse == NULL)
    {
      APP_DBG("WARNING : pOT_MessageResponse = NULL ! -> exit now");
      break;
    }

    otCoapMessageInitResponse(pOT_MessageResponse,
        pMessage,
        OT_COAP_TYPE_ACKNOWLEDGMENT,
        OT_COAP_CODE_VALID);

    error = otCoapSendResponse(NULL, pOT_MessageResponse, pMessageInfo);
    if (error != OT_ERROR_NONE && pOT_MessageResponse != NULL)
    {
      otMessageFree(pOT_MessageResponse);
//      APP_THREAD_Error(ERR_THREAD_COAP_DATA_RESPONSE,error);
    }
  }while(false);
}
/* USER CODE END FD_WRAP_FUNCTIONS */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
